Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: The thunder on the air promises battle!
pt_pt: A tempestade promete batalha!

source: Power up your Guardians with epic outfits and challenge the Archdemon himself!
pt_pt: Melhora os teus Guardiões com visuais épicos e desafia o próprio Grão-Demónio!

source: Skill Booster
pt_pt: Reforço de habilidade

source: Your game ID
pt_pt: A tua ID de jogo

source: Join the adventures with Lara Croft!
pt_pt: Junta-te às aventuras com Lara Croft!

source: Test this radiant Tank in Brawls, complete quest chains, upgrade artifacts, and get ready for some great rewards!
pt_pt: Põe à prova este Tanque em Combates, conclui missões, melhora artefactos e prepara-te para excelentes recompensas!

source: Free Gold!
pt_pt: Ouro grátis!

source: Click the image to get free Gold!
pt_pt: Clica na imagem para obter Ouro grátis!

source: Disconnect
pt_pt: Desassociar

source: Reset password instructions
pt_pt: Instruções de reposição de palavra-passe

source: My Account
pt_pt: A minha conta

source: Hero Wars: Fire it UP
pt_pt: Hero Wars: A Temperatura Está a SUBIR

source: We completely understand how important such resources are.
pt_pt: Compreendemos totalmente como os recursos são importantes.

source: We'll be sure to pass your feedback onto the dev team!
pt_pt: Vamos passar os teus comentários para a equipa de desenvolvimento!

source: By the way, don't forget to explore locations on the Islands — there is a big chance to find what you need there.
pt_pt: Já agora, não te esqueças de explorar vários locais nas Ilhas, pois há a grande possibilidade de lá encontrares o que necessitas.

source: Good luck!
pt_pt: Boa sorte!

source: The purr-fect update!
pt_pt: Uma atualização purrfeita!

source: Leprecat Festival Join in the fluffy fun and get your paws on some valuable prizes!
pt_pt: Festival dos Gnomolinos Junta-te a esta diversão em tons de pelúcia e põe as garras em cima de prémios valiosos!

source: Artemis buff Our sharpshooting huntress has learned a couple of new skills, and now she can't wait to pierce foes with her arrows!
pt_pt: Reforço de Ártemis A mais certeira das caçadoras aprendeu uns truques novos, e mal pode esperar por perfurar os adversários com as suas flechas!

source: Bring Artemis to the battlefield alongside other Way of Honor heroes and watch her unleash those new abilities!
pt_pt: Entra em ação com Ártemis e outros heróis do Caminho da Honra para veres do que são capazes!

source: It's time to go hunting!
pt_pt: Chegou a hora de caçar!

source: Hero Reborn
pt_pt: Herói Renascido

source: Aurora is Hero of the Month!
pt_pt: Aurora é a Heroína do mês!

source: Spring is almost over — time to get to work with the new Battle Pass quests! Check out the angelic Mushy and Shroom skin as well as other valuable and pretty rewards. Complete daily quests to farm resources! Take the most out of your Battle Pass with the premium version and receive a lovely springtime avatar and a flowery frame as a gift!
pt_pt: O verão está à porta! Está na hora de te atirares às missões do novo Passe de Batalha! Não percas o visual angélico para Mushy e Shroom e outras recompensas fantásticas! Conclui missões diárias e ganha recursos! Aproveita ao máximo a versão premium do Passe de Batalha e recebe um avatar primaveril e uma moldura florida!

source: Romantic Holiday in Hero Wars!
pt_pt: Romance no Hero Wars!

source: SO WHAT?
pt_pt: SÓ ISSO?

source: A special event with Lunar Hero Skins!
pt_pt: Um evento especial com Visuais de Heróis Lunares!

source: Back in Time
pt_pt: Regresso ao Passado

source: We can assure you that the game is free to play, and it’s possible to complete all the tasks without spending money :) Just don’t give up!
pt_pt: Garantimos que o jogo é grátis e que é possível concluir todas as tarefas sem gastar dinheiro :) Não desistas!

source: You can choose to purchase some of our packs if you’d like to, but it’s totally up to you!
pt_pt: Se quiseres, podes comprar alguns dos nossos pacotes, mas isso é uma decisão tua!

source: Something went wrong
pt_pt: Ocorreu um erro

source: FIGHT TO SURVIVE!
pt_pt: LUTA E SOBREVIVE!

source: SAVE HER
pt_pt: SALVA-A

source: Good tidings in Dominion!
pt_pt: Boas novas no Domínio!

source: The Punishing Hand Meet Rigel, the new Light Titan who will act as an indestructible shield for your team!
pt_pt: A Mão que Castiga Descobre Rigel, o novo Titã de Luz e um verdadeiro escudo indestrutível para a tua equipa!

source: Unleash his power by joining Brawls.
pt_pt: Participa em Brigas e usa todo o seu poder!

source: Complete quest chains to power up the radiant defender and upgrade his unique artifacts.
pt_pt: Conclui séries de missões para melhorar este defensor luminoso e os seus artefactos únicos.

source: The Magic Tree A magic seedling has sprouted through the cobblestones in the city square.
pt_pt: A Árvore Mágica Nasceu um rebento mágico na praça da cidade.

source: Help your guild grow the most powerful tree and earn valuable rewards!
pt_pt: Ajuda a tua guilda a conseguir a árvore mais poderosa e ganha recompensas valiosas!

source: Seize the day and bask in your glory!
pt_pt: Aproveita e banha-te em glória!

source: E-mail is confirmed!
pt_pt: E-mail confirmado!

source: Take part in the special Black Friday event!
pt_pt: Participa no evento especial Black Friday

source: Take part in ruthless battles between Gold League members from all servers!
pt_pt: Enfrenta membros da Liga de Ouro de todos os servidores!

source: Fan Content Policy: https://nextersglobal.com/fan_content_hw_io
pt_pt: Política de conteúdos de fãs: https://nextersglobal.com/fan_content_hw_io

source: Worry Free
pt_pt: Batalha automática

source: Autumn Festival!
pt_pt: Festival de Outono!

source: LOOT EFFORTLESSLY
pt_pt: SAQUEIA FACILMENTE

source: Swedish Krona
pt_pt: Coroa sueca

source: 404:</br> Page not found
pt_pt: 404:</br> Página não encontrada

source: Create a password
pt_pt: Criar uma palavra-passe

source: The Dominion is turning into a winter wonderland!
pt_pt: O Domínio transformou-se num paraíso invernal!

source: Get ready for fun activities, events, and special holiday releases!
pt_pt: Prepara-te para atividades divertidas, eventos e lançamentos festivos!

source: Join the event and test renewed Artemis in battle!
pt_pt: Junta-te ao evento e testa uma Ártemis renovada!

source: · Various optimizations and small improvements!
pt_pt: · Várias otimizações e pequenas melhorias!

source: Receive special offers from Throne Rush (may contain gifts!)
pt_pt: Recebe ofertas especiais de Throne Rush (pode conter presentes!)

source: The Path to Greatness!
pt_pt: O Caminho Para a Grandeza!

source: The new Heroes arrived in the Dominion!
pt_pt: Há novos heróis no Domínio!

source: Help them save the forest and defeat the Evil Spirit to obtain valuable rewards!
pt_pt: Ajuda-os a salvar a floresta, derrota o Espírito Maléfico e ganha recompensas fantásticas!

source: Enjoying "Hero Wars"?
pt_pt: Está a gostar do Hero Wars?

source: Remember me
pt_pt: Lembrar-me

source: Sign in with Facebook
pt_pt: Iniciar sessão via Facebook

source: HOW TO BECOME A HERO?
pt_pt: COMO SER UM HERÓI?

source: Amira is here!
pt_pt: Chegou a Amira!

source: Join the winter of wishes!
pt_pt: Vem celebrar as boas festas!

source: Oops,</br> besides ghosts there is nothing
pt_pt: Ups,</br> não existe mais nada para além de fantasmas

source: It's time for a restock!
pt_pt: Está na altura de reabastecer!

source: This April, you'll not only get plenty of useful resources but also some charming spring items!
pt_pt: Neste abril, não terás apenas um monte de recursos úteis, como também itens de primavera encantadores!

source: The Premium Pass will get you even more rewards and decorations!
pt_pt: O Passe Premium dar-te-á ainda mais recompensas e decorações!

source: Solaris is the mighty Super Titan of Light, born from the spring sunshine, and she's ready to strike her foes blind! In this new Easter event, you'll be able to grow her power even more. Complete quests to buy Solaris Soul Stones and artifact fragments from the Store of Light, and don't forget to stock up on useful resources with great x4 value packs and sale-price chests!
pt_pt: Solaris é a poderosa Supertitã da Luz, nascida da luz do sol da primavera. Ela está pronta para derrotar os seus inimigos, cegando-os! Neste evento de Páscoa, poderás melhorar ainda mais o seu poder. Conclui missões para comprar Pedras Anímicas de Solaris e fragmentos de artefactos na Loja da Luz. Não te esqueças de te abastecer de recursos úteis com excelentes pacotes e baús em promoção!

source: There is already an account registered to this e-mail address.
pt_pt: Já existe uma conta registada com este endereço de e-mail.

source: Log in with the password or reset your password.
pt_pt: Inicia sessão com a palavra-passe ou repõe a tua palavra-passe.

source: You can always link your social media profiles to the account later in settings.
pt_pt: Podes sempre associar os teus perfis das redes sociais à conta mais tarde nas definições.

source: The crafty fighter Ishmael battles both the enemy and his inner darkness!
pt_pt: Ishmael enfrenta tanto os inimigos dele como a sua própria natureza sombria!

source: Free Energy!
pt_pt: Energia grátis!

source: Click the image to get free Energy!
pt_pt: Clica na imagem para obter Energia grátis!

source: Here you need to tap on the mushrooms in the correct order.
pt_pt: Tens de tocar nos cogumelos pela ordem correta.

source: Just a hint: keep an eye on those fireflies
pt_pt: Eis uma dica: toma atenção aos pirilampos

source: Earn Battle Pass Points in seasonal events and work your way up to the main prize—resources for Soleil and Amira's skin!
pt_pt: Ganha Pontos do Passe de Batalha em eventos sazonais e obtém o grande prémio: recursos para os visuais de Soleil e Amira

source: The game progress is linked to your Google Play/App Store account.
pt_pt: O progresso do jogo está ligado à tua conta do Google Play/App Store.

source: You know how to use all these wisely!
pt_pt: Sabes como utilizar todos estes itens de forma inteligente!

source: Hero Brawls — Folio
pt_pt: Lutas de Herói — Folio

source: Log into the game daily to obtain Maya's Soul Stones!
pt_pt: Inicia sessão diariamente e obtém Pedras Anímicas de Maya!

source: Log into the game and get upgrades for the incomparable Arachne every day.
pt_pt: Inicia sessão e obtém melhorias todos os dias para a incomparável Arachne.

source: No enemy can escape her clutches!
pt_pt: Não há inimigo que escape das suas garras!

source: Log in every day until the end of October and get Soul Stones for Dorian!
pt_pt: Inicia sessão cada dia até final de outubro e obtém pedras anímicas para Dorian!

source: Raise his Blood Magic powers to a new level!
pt_pt: Aumenta o seu poder de Magia de Sangue!

source: The Guardians really know how to refine their battle mastery, not only by themselves, but together as comrades!
pt_pt: Os Guardiões sabem refinar a sua mestria em combate, tanto a sós como em conjunto!

source: Upgrade the skills of an entire class of heroes at once using the Rune Spheres you can earn by completing the event’s quests.
pt_pt: Usa as Esferas de Runas que ganhares nas missões de evento para melhorar as habilidades de uma classe de heróis de uma assentada.

source: Collect as many of these valuable resources as you can while the event lasts!
pt_pt: Aproveita o evento e apanha quantas conseguires!

source: Show your class!
pt_pt: Mostra que tens classe!

source: Hero’s Way
pt_pt: O Caminho do Herói

source: Now you can get higher artifact resources at lower levels of chests.
pt_pt: Agora podes obter artefactos de nível melhor em baús de nível inferior.

source: TRY FOR FREE
pt_pt: EXPERIMENTA GRÁTIS

source: Start the year fully armed and in style!
pt_pt: Comece o ano totalmente armado e com estilo!

source: The Battle Pass can provide you with useful resources, while the Premium Pass contains a cool avatar and a striking frame, too.
pt_pt: O Battle Pass pode disponibilizar-lhe recursos úteis, enquanto que o Premium Pass contém um avatar fixe e também uma moldura impressionante.

source: Don't miss out on the unique bonuses!
pt_pt: Não perca os bónus exclusivos!

source: Hello! Thanks for your feedback, it helps us make the game even better. Thank you for your time!
pt_pt: Olá! Obrigado pela tua avaliação. Vai ajudar-nos a tornar o jogo ainda melhor. Agradecemos a tua participação!

source: Hunt with allies!
pt_pt: Caça com aliados!

source: Power up your Guardians to get the highest score!
pt_pt: Fortalece os Guardiões e obtém a melhor pontuação!

source: Black Friday in Dominion!
pt_pt: Black Friday no Domínio!

source: Grab some new looks and a Superskin for Faceless!
pt_pt: Há novos estilos e um Supervisual para Sem Rosto!

source: All hail Brave Hero! We’re just about done. To confirm your e-mail just select the button below: Confirm Or follow the link: In case of any questions contact us via support@herowars.zendesk.com, Your Hero Wars Team. P.S. If you have no idea what is this letter about just ignore it.
pt_pt: Viva, herói! Estamos quase a terminar. Para confirmares o teu e-mail, basta selecionares o botão abaixo: Confirmar Alternativamente, podes seguir o link: Em caso de questões, contacta-nos através do e-mail support@herowars.zendesk.com. A equipa de Hero Wars. P.S.: Se não fizeres ideia de que se trata esta carta, ignora-a.

source: WANTED
pt_pt: PROCURA-SE

source: The Legends Draft is here!
pt_pt: Chegou o Recrutamento de Lendas!

source: Beat different opponents in random fights for glory, gold, and other prizes!
pt_pt: Vence adversários em combates aleatórios para conquistar a glória, ouro e mais!

source: You need to press the buttons that are indicated on the door Tap on the quest's icon and follow the path to get to those buttons.
pt_pt: Tens de premir os botões que estão indicados na porta Toca no ícone da missão e segue o caminho até chegares a esses botões.

source: Support
pt_pt: Suporte

source: Hello there!
pt_pt: Olá, olá!

source: Would you please contact our support team so that they could look into this?
pt_pt: Será que poderias contactar a nossa equipa de suporte para que eles analisem o assunto?

source: You can do so via the game settings.
pt_pt: Podes fazer isso através das definições do jogo.

source: Thank you in advance!
pt_pt: Agradecemos desde já!

source: Become a Hero!
pt_pt: Sê um Herói!

source: Log in daily to harvest Soul Stones and make this Mystery Healer's power grow!
pt_pt: Inicia sessão diariamente, obtém Pedras Anímicas e aumenta o poder desta curandeira misteriosa!

source: Thank you for reaching out!
pt_pt: Obrigado por nos contactares!

source: There are so many cool features in our game, and we couldn’t fit them all in an ad.
pt_pt: O nosso jogo tem muitas caraterísticas interessantes, impossíveis de apresentar num anúncio.

source: The intention of our ads is to draw your attention to the game so that you can check it out yourself — for example, our new Tower game at the City Gate offers awesome rewards.
pt_pt: O objetivo dos nossos anúncios é captar a tua atenção para que tires as tuas conclusões, por exemplo, o novo modo Torre no Portão da Cidade dá-te recompensas fantásticas.

source: We hope that you have a good time playing Hero Wars!
pt_pt: Esperamos que te divirtas a jogar o Hero Wars!

source: Iyari is ready to shake up the world of Titans!
pt_pt: Iyari está pronta para fazer tremer o mundo dos Titãs!

source: Add her to your team to unleash the full potential of the Light!
pt_pt: Adiciona-a à tua equipa e liberta todo o potencial da Luz!

source: This Month's Hero is Morrigan!
pt_pt: A heroína do mês é Morrigan!

source: User has another account
pt_pt: O utilizador tem outra conta

source: This account belongs to another user.
pt_pt: Esta conta pertence a outro utilizador.

source: Please use a different one.
pt_pt: Utiliza uma conta diferente.

source: • Fight boss battles against legendary foes in the battle arena
pt_pt: • Enfrentar bosses em combates contra inimigos lendários na arena de batalha

source: Solar Skin Sale!
pt_pt: Promoção de Visual Solar!

source: Astrid and Lucas, Ishmael and Tristan have been charged up with solar energy, ready to incinerate their foes!
pt_pt: Astrid e Lucas, Ishmael e Tristan receberam toda a força da energia solar e estão prontos a chamuscar os inimigos!

source: Faction Brawls in Dominion!
pt_pt: Lutas de Fação no Domínio!

source: Dante, Lilith, and Julius are dressing up for the Lunar New Year, and the Curiosity Shop has new items in stock!
pt_pt: Dante, Lilith e Julius vão vestir-se a rigor para o Ano Novo Lunar e a Loja de Curiosidades tem novos itens!

source: - Say hi to an improved Heidi!
pt_pt: - Vem cumprimentar o Heidi aperfeiçoado!

source: The cutest mage in the game is ready to join you in battle!
pt_pt: O Mago mais engraçado do jogo está pronto para combater!

source: New frames and avatars
pt_pt: Novas molduras e avatares

source: St. Valentine's Day!
pt_pt: Dia de São Valentim!

source: Hurry up to get some luminous outfits for Kayla, Aidan, and Heidi.
pt_pt: Obtém já fatos luminosos para Kayla, Aidan e Heidi.

source: Complete quests and get themed Coins and Chests to collect some useful resources and power up your team.
pt_pt: Conclui missões e obtém Moedas e Baús temáticos para recolher recursos úteis e reforçar a tua equipa.

source: Also, don't miss the Dominion’s latest big news: Heidi just got revamped!
pt_pt: E não percas as últimas notícias do Domínio: Heidi foi transformado!

source: The fluffy assassin is ready to join the battle and strikes his enemies with new skills.
pt_pt: O assassino fofo está pronto para se juntar à batalha e golpear os inimigos com novas habilidades.

source: Try his updated version in various teams, find the best combinations, and prove victorious!
pt_pt: Experimenta esta versão atualizada em várias equipas, encontra as melhores combinações e sai vitorioso!

source: Earn rewards with the March Battle Pass!
pt_pt: Ganha recompensas com o Passe de Batalha de março!

source: Czech Koruna
pt_pt: Coroa checa

source: Play for Free
pt_pt: Joga grátis

source: A legend arrives in Dominion on May 13th!
pt_pt: Uma lenda chega ao Domínio a 13 de maio!

source: The great Tenebris will take the Dark Titans under her sinister wing, forever changing the game!
pt_pt: Tenebris vai liderar os Titãs das Trevas, mudando o jogo para sempre!

source: Test her out in Brawls!
pt_pt: Experimenta-a nas Brigas!

source: A new event for the whole Guild in the Dominion!
pt_pt: Um novo evento para as guildas do Domínio!

source: Earn more resources with the new Battle Pass!
pt_pt: Ganha mais recursos com o novo Passe de Batalha!

source: Treasure Island event!
pt_pt: Evento da Ilha dos Tesouros!

source: Now that summer is in full swing, Maya is organizing a Tropical Fair!
pt_pt: A Maya decidiu organizar a Feira Tropical agora que estamos no verão!

source: Hero Rework Maya's flower now protects her for a longer time and heals allies more efficiently.
pt_pt: Atualização de Herói Agora a flor da Maya protege-a durante mais tempo e cura os companheiros de forma mais eficiente.

source: The titan-child's other skills deal more damage.
pt_pt: As outras habilidades dela passam a causar mais dano.

source: Tropical Fair Now the whole island is going to celebrate with Maya!
pt_pt: Feira Tropical Toda a ilha vai celebrar com a Maya!

source: Enjoy vibrant summer avatars, huge discounts, unlimited items in the Tropical Shop, and activity bonuses.
pt_pt: Diverte-te com avatares vibrantes de verão, descontos incríveis, itens ilimitados na Loja Tropical e bónus de atividade.

source: Join Maya and enjoy the summertime while it lasts!
pt_pt: Aproveita o verão com a Maya!

source: The Spring Skins are here!
pt_pt: Visuais de primavera!

source: Check out this post: facebook.com/IslandQuestaway/posts/440858114399703.
pt_pt: Vê só este post: facebook.com/IslandQuestaway/posts/440858114399703.

source: You'll definitely find a few hints there
pt_pt: Aqui podes encontrar algumas dicas

source: We're deeply sorry about such inconvenience Our devs are trying their best to fix this issue but it's going to take a bit more time.
pt_pt: Pedimos desculpa por este inconveniente Os nossos desenvolvedores estão a dar o seu melhor para resolver o problema, mas vai demorar algum tempo.

source: In the meantime, we appreciate your patience and understanding!
pt_pt: No entanto, agradecemos a tua paciência e compreensão!

source: Wrong e-mail
pt_pt: E-mail errado

source: Join the event to unlock Lara in 3 different Skins! Collect Artifacts and Soul Stones to help her explore the new world!
pt_pt: Desbloqueia os seus 3 diferentes Visuais no evento! Recolhe Artefactos e Pedras Anímicas e explora o novo mundo!

source: A Line-Up of Talismans
pt_pt: Talismãs a rodos

source: Stock up on resources and get some Titan Skins!
pt_pt: Obtém recursos e novos visuais de Titãs!

source: • Join a guild or start your own to share skills and train with other warriors
pt_pt: • Juntar-te a uma guilda ou começar a tua própria para partilhar habilidades e treinar com outros guerreiros

source: Dark Carnival
pt_pt: Carnaval das Trevas

source: Hero Wars: It's Fun Time
pt_pt: Hero Wars: Hora da Diversão

source: Nature's got a special winter present for you! Oya, a powerful warrior following the Way of Nature and the last chieftain of a lost tribe, is coming to the Dominion, ready to join the Guardians' fight against the forces of evil. She'll power up your team (and the impression it makes), as her powerful strikes can break through any defenses. Unleash the full potential of Nature with Oya!
pt_pt: A Natureza tem uma prenda especial de inverno para ti! Oya chega ao Domínio, uma guerreira poderosa que segue o Caminho da Natureza e que é a última chefe de uma tribo perdida. Está pronta para se juntar à luta dos Guardiões contra as forças do mal. Ela irá melhorar a tua equipa com os seus ataques poderosos que atravessam quaisquer defesas! Mostra todo o potencial da Natureza com Oya!

source: Technical updates!
pt_pt: Atualizações técnicas!

source: Come grab your +300 energy, +X gold, and +25 Honorable Guardian Boxes!
pt_pt: Recolhe +300 de energia, +X de ouro e +25 Urnas do Honrado Guardião!

source: Norwegian Krone
pt_pt: Coroa norueguesa

source: Curse of the Abyss!
pt_pt: A Maldição do Abismo!

source: Thank you for your feedback, we're thrilled to know that you enjoy playing our game :)
pt_pt: Agradecemos os teus comentários e estamos muito felizes por gostares do nosso jogo :)

source: Don't miss the grand celebration of Hero Wars' seventh anniversary!
pt_pt: Celebra o sétimo aniversário do Hero Wars!

source: Also, make sure to check out our fan group as you can get help from other players there: facebook.com/groups/island.questaway
pt_pt: Não te esqueças de visitar o nosso grupo de fãs, onde podes obter ajuda de outros jogadores: facebook.com/groups/island.questaway

source: Your Hero Wars team.
pt_pt: A equipa de Hero Wars.

source: Iris is here!
pt_pt: Iris chegou!

source: Join the new adventure!
pt_pt: Descobre a nova aventura!

source: New sunny Skins are already in Dominion!
pt_pt: Há novos visuais ensolarados no Domínio!

source: Power up your heroes, unlock skills, train your army, and forge a guild.
pt_pt: Reforça os teus heróis, desbloqueia habilidades, treina o teu exército e forma uma guilda.

source: Do battle in exhilarating multiplayer wars with this online AFK RPG fantasy adventure.
pt_pt: Combate em emocionantes guerras multijogador com esta aventura AFK RPG online.

source: Prove your worth as a great warrior and leave behind a legacy of peace in the Dominion!
pt_pt: Prova o teu valor como um grande guerreiro e deixa para trás um legado de paz no Domínio!
